app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = 3 LIMIT 1
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
---
  def similar
    movie = Movie.find_by_id(params[:id])
    director = movie.director unless movie.blank?